---
kind: property
id: P:Autodesk.Revit.DB.Transform1D.IsIdentity
source: html/2018e491-c52a-026e-6f47-189288fa2d64.htm
---
# Autodesk.Revit.DB.Transform1D.IsIdentity Property

The boolean value that indicates whether this transformation is an identity.

## Syntax (C#)
```csharp
public bool IsIdentity { get; }
```

## Remarks
The identity transformation does not change a point or a vector that it is applied to.